# NumberOfPoints Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..NumberOfPoints Property
PolymeshTopology Class See Also
---
The number of points in the polymesh
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfPoints { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfPoints As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfPoints {
	int get ();
}
```

# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace